Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/btzbsys.h
/* -------- BTZBSYS_SUBSYS_STATUS_REG0 : (BTZBSYS Offset: 0x20) ( R/ 32) SUBSYS_STATUS_REG0 -------- */
#define BTZBSYS_SUBSYS_STATUS_REG0_RESETVALUE _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_STATUS_REG0) SUBSYS_STATUS_REG0  Reset Value */

#define BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_sleep_mode Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_sleep_mode Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode(value) (BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_zb_sleep_mode_Pos)) /* Assignment of value for zb_sleep_mode in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Pos _UINT32_(1)                                          /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_deep_sleep_mode Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) zb_deep_sleep_mode Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode(value) (BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_zb_deep_sleep_mode_Pos)) /* Assignment of value for zb_deep_sleep_mode in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Pos _UINT32_(2)                                          /* (BTZBSYS_SUBSYS_STATUS_REG0) radio_idle_zb Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) radio_idle_zb Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb(value) (BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_radio_idle_zb_Pos)) /* Assignment of value for radio_idle_zb in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Pos _UINT32_(16)                                         /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_low_power_mode Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_low_power_mode Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode(value) (BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_bt_low_power_mode_Pos)) /* Assignment of value for bt_low_power_mode in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Pos _UINT32_(17)                                         /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_rf_idle Position */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG0) bt_rf_idle Mask */
#define BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle(value) (BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG0_bt_rf_idle_Pos)) /* Assignment of value for bt_rf_idle in the BTZBSYS_SUBSYS_STATUS_REG0 register */
#define BTZBSYS_SUBSYS_STATUS_REG0_Msk        _UINT32_(0x00030007)                                 /* (BTZBSYS_SUBSYS_STATUS_REG0) Register Mask  */


/* -------- BTZBSYS_SUBSYS_STATUS_REG1 : (BTZBSYS Offset: 0x24) ( R/ 32) SUBSYS_STATUS_REG1 -------- */
#define BTZBSYS_SUBSYS_STATUS_REG1_RESETVALUE _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_STATUS_REG1) SUBSYS_STATUS_REG1  Reset Value */

#define BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) xtal_ready_out Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) xtal_ready_out Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out(value) (BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_xtal_ready_out_Pos)) /* Assignment of value for xtal_ready_out in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Pos _UINT32_(1)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) pll_lock_out Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) pll_lock_out Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out(value) (BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_out_Pos)) /* Assignment of value for pll_lock_out in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Pos _UINT32_(2)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) XTAL_ready Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) XTAL_ready Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready(value) (BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_XTAL_ready_Pos)) /* Assignment of value for XTAL_ready in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Pos _UINT32_(3)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) PLL_locked Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) PLL_locked Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked(value) (BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_PLL_locked_Pos)) /* Assignment of value for PLL_locked in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Pos _UINT32_(4)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) clk_lp_ready Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) clk_lp_ready Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready(value) (BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_clk_lp_ready_Pos)) /* Assignment of value for clk_lp_ready in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_mux_sel_Pos _UINT32_(5)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) clk_mux_sel0 Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_mux_sel_Msk (_UINT32_(0x3) << BTZBSYS_SUBSYS_STATUS_REG1_clk_mux_sel_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) clk_mux_sel0 Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_clk_mux_sel(value) (BTZBSYS_SUBSYS_STATUS_REG1_clk_mux_sel_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_clk_mux_sel_Pos)) /* Assignment of value for clk_mux_sel in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_fifo_empty_Pos _UINT32_(7)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) XTAL_ready Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_fifo_empty_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_fifo_empty_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) XTAL_ready Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_fifo_empty(value) (BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_fifo_empty_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_pll_lock_fifo_empty_Pos)) /* Assignment of value for pll_lock_fifo_empty in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_pllc_ready_cnt_expire_raw_Pos _UINT32_(8)                                          /* (BTZBSYS_SUBSYS_STATUS_REG1) pllc_ready_cnt_expire_raw Position */
#define BTZBSYS_SUBSYS_STATUS_REG1_pllc_ready_cnt_expire_raw_Msk (_UINT32_(0x1) << BTZBSYS_SUBSYS_STATUS_REG1_pllc_ready_cnt_expire_raw_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG1) pllc_ready_cnt_expire_raw Mask */
#define BTZBSYS_SUBSYS_STATUS_REG1_pllc_ready_cnt_expire_raw(value) (BTZBSYS_SUBSYS_STATUS_REG1_pllc_ready_cnt_expire_raw_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG1_pllc_ready_cnt_expire_raw_Pos)) /* Assignment of value for pllc_ready_cnt_expire_raw in the BTZBSYS_SUBSYS_STATUS_REG1 register */
#define BTZBSYS_SUBSYS_STATUS_REG1_Msk        _UINT32_(0x000001FF)                                 /* (BTZBSYS_SUBSYS_STATUS_REG1) Register Mask  */


/* -------- BTZBSYS_SUBSYS_STATUS_REG2 : (BTZBSYS Offset: 0x28) ( R/ 32) SUBSYS_STATUS_REG2 -------- */
#define BTZBSYS_SUBSYS_STATUS_REG2_RESETVALUE _UINT32_(0x00)                                       /*  (BTZBSYS_SUBSYS_STATUS_REG2) SUBSYS_STATUS_REG2  Reset Value */

#define BTZBSYS_SUBSYS_STATUS_REG2_VERSION_NUM_Pos _UINT32_(0)                                          /* (BTZBSYS_SUBSYS_STATUS_REG2) VERSION_NUM Position */
#define BTZBSYS_SUBSYS_STATUS_REG2_VERSION_NUM_Msk (_UINT32_(0xFF) << BTZBSYS_SUBSYS_STATUS_REG2_VERSION_NUM_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG2) VERSION_NUM Mask */
#define BTZBSYS_SUBSYS_STATUS_REG2_VERSION_NUM(value) (BTZBSYS_SUBSYS_STATUS_REG2_VERSION_NUM_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG2_VERSION_NUM_Pos)) /* Assignment of value for VERSION_NUM in the BTZBSYS_SUBSYS_STATUS_REG2 register */
#define BTZBSYS_SUBSYS_STATUS_REG2_PART_NUM_Pos _UINT32_(8)                                          /* (BTZBSYS_SUBSYS_STATUS_REG2) PART_NUM Position */
#define BTZBSYS_SUBSYS_STATUS_REG2_PART_NUM_Msk (_UINT32_(0xFF) << BTZBSYS_SUBSYS_STATUS_REG2_PART_NUM_Pos) /* (BTZBSYS_SUBSYS_STATUS_REG2) PART_NUM Mask */
#define BTZBSYS_SUBSYS_STATUS_REG2_PART_NUM(value) (BTZBSYS_SUBSYS_STATUS_REG2_PART_NUM_Msk & (_UINT32_(value) << BTZBSYS_SUBSYS_STATUS_REG2_PART_NUM_Pos)) /* Assignment of value for PART_NUM in the BTZBSYS_SUBSYS_STATUS_REG2 register */
#define BTZBSYS_SUBSYS_STATUS_REG2_Msk        _UINT32_(0x0000FFFF)                                 /* (BTZBSYS_SUBSYS_STATUS_REG2) Register Mask  */


/* BTZBSYS register offsets definitions */
#define BTZBSYS_SUBSYS_CNTRL_REG0_REG_OFST _UINT32_(0x00)      /* (BTZBSYS_SUBSYS_CNTRL_REG0) SUBSYS_CNTRL_REG0 Offset */
#define BTZBSYS_SUBSYS_CNTRL_REG1_REG_OFST _UINT32_(0x04)      /* (BTZBSYS_SUBSYS_CNTRL_REG1) SUBSYS_CNTRL_REG1 Offset */
#define BTZBSYS_SUBSYS_CNTRL_REG2_REG_OFST _UINT32_(0x08)      /* (BTZBSYS_SUBSYS_CNTRL_REG2) SUBSYS_CNTRL_REG2 Offset */
#define BTZBSYS_SUBSYS_CNTRL_REG3_REG_OFST _UINT32_(0x0C)      /* (BTZBSYS_SUBSYS_CNTRL_REG3) SUBSYS_CNTRL_REG3 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG0_REG_OFST _UINT32_(0x20)      /* (BTZBSYS_SUBSYS_STATUS_REG0) SUBSYS_STATUS_REG0 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG1_REG_OFST _UINT32_(0x24)      /* (BTZBSYS_SUBSYS_STATUS_REG1) SUBSYS_STATUS_REG1 Offset */
#define BTZBSYS_SUBSYS_STATUS_REG2_REG_OFST _UINT32_(0x28)      /* (BTZBSYS_SUBSYS_STATUS_REG2) SUBSYS_STATUS_REG2 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* BTZBSYS register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG0; /* Offset: 0x00 (R/W  32) SUBSYS_CNTRL_REG0 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG1; /* Offset: 0x04 (R/W  32) SUBSYS_CNTRL_REG1 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG2; /* Offset: 0x08 (R/W  32) SUBSYS_CNTRL_REG2 */
  __IO  uint32_t                       BTZBSYS_SUBSYS_CNTRL_REG3; /* Offset: 0x0C (R/W  32) SUBSYS_CNTRL_REG3 */
  __I   uint8_t                        Reserved1[0x10];
  __I   uint32_t                       BTZBSYS_SUBSYS_STATUS_REG0; /* Offset: 0x20 (R/   32) SUBSYS_STATUS_REG0 */
  __I   uint32_t                       BTZBSYS_SUBSYS_STATUS_REG1; /* Offset: 0x24 (R/   32) SUBSYS_STATUS_REG1 */
  __I   uint32_t                       BTZBSYS_SUBSYS_STATUS_REG2; /* Offset: 0x28 (R/   32) SUBSYS_STATUS_REG2 */
} btzbsys_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32WM_BZ6_BTZBSYS_COMPONENT_H_ */
